grevaillot/svd_tools/headers/ATSAMV71N21B/pwm1.h
/** PWM1_PWM_OSCUPD_OSCUPL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM1_PWM_OSCUPD_OSCUPL3		(1 << 19)
/** PWM1_PWM_OSCUPD_OSCUPL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM1_PWM_OSCUPD_OSCUPL2		(1 << 18)
/** PWM1_PWM_OSCUPD_OSCUPL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM1_PWM_OSCUPD_OSCUPL1		(1 << 17)
/** PWM1_PWM_OSCUPD_OSCUPL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM1_PWM_OSCUPD_OSCUPL0		(1 << 16)
/** PWM1_PWM_OSCUPD_OSCUPH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM1_PWM_OSCUPD_OSCUPH3		(1 << 3)
/** PWM1_PWM_OSCUPD_OSCUPH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM1_PWM_OSCUPD_OSCUPH2		(1 << 2)
/** PWM1_PWM_OSCUPD_OSCUPH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM1_PWM_OSCUPD_OSCUPH1		(1 << 1)
/** PWM1_PWM_OSCUPD_OSCUPH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM1_PWM_OSCUPD_OSCUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_fmr PWMFMR PWM Fault Mode Register
@{*/


#define PWM1_PWM_FMR_FFIL_SHIFT		16
#define PWM1_PWM_FMR_FFIL_MASK		0xff
/** @defgroup pwm1_pwm_fmr_ffil FFIL Fault Filtering
@{*/
/**@}*/


#define PWM1_PWM_FMR_FMOD_SHIFT		8
#define PWM1_PWM_FMR_FMOD_MASK		0xff
/** @defgroup pwm1_pwm_fmr_fmod FMOD Fault Activation Mode
@{*/
/**@}*/


#define PWM1_PWM_FMR_FPOL_SHIFT		0
#define PWM1_PWM_FMR_FPOL_MASK		0xff
/** @defgroup pwm1_pwm_fmr_fpol FPOL Fault Polarity
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_fsr PWMFSR PWM Fault Status Register
@{*/


#define PWM1_PWM_FSR_FS_SHIFT		8
#define PWM1_PWM_FSR_FS_MASK		0xff
/** @defgroup pwm1_pwm_fsr_fs FS Fault Status
@{*/
/**@}*/


#define PWM1_PWM_FSR_FIV_SHIFT		0
#define PWM1_PWM_FSR_FIV_MASK		0xff
/** @defgroup pwm1_pwm_fsr_fiv FIV Fault Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_fcr PWMFCR PWM Fault Clear Register
@{*/


#define PWM1_PWM_FCR_FCLR_SHIFT		0
#define PWM1_PWM_FCR_FCLR_MASK		0xff
/** @defgroup pwm1_pwm_fcr_fclr FCLR Fault Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_fpv1 PWMFPV1 PWM Fault Protection Value Register 1
@{*/

/** PWM1_PWM_FPV1_FPVL3 Fault Protection Value for PWML output on channel 3 **/
#define PWM1_PWM_FPV1_FPVL3		(1 << 19)
/** PWM1_PWM_FPV1_FPVL2 Fault Protection Value for PWML output on channel 2 **/
#define PWM1_PWM_FPV1_FPVL2		(1 << 18)
/** PWM1_PWM_FPV1_FPVL1 Fault Protection Value for PWML output on channel 1 **/
#define PWM1_PWM_FPV1_FPVL1		(1 << 17)
/** PWM1_PWM_FPV1_FPVL0 Fault Protection Value for PWML output on channel 0 **/
#define PWM1_PWM_FPV1_FPVL0		(1 << 16)
/** PWM1_PWM_FPV1_FPVH3 Fault Protection Value for PWMH output on channel 3 **/
#define PWM1_PWM_FPV1_FPVH3		(1 << 3)
/** PWM1_PWM_FPV1_FPVH2 Fault Protection Value for PWMH output on channel 2 **/
#define PWM1_PWM_FPV1_FPVH2		(1 << 2)
/** PWM1_PWM_FPV1_FPVH1 Fault Protection Value for PWMH output on channel 1 **/
#define PWM1_PWM_FPV1_FPVH1		(1 << 1)
/** PWM1_PWM_FPV1_FPVH0 Fault Protection Value for PWMH output on channel 0 **/
#define PWM1_PWM_FPV1_FPVH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_fpe PWMFPE PWM Fault Protection Enable Register
@{*/


#define PWM1_PWM_FPE_FPE3_SHIFT		24
#define PWM1_PWM_FPE_FPE3_MASK		0xff
/** @defgroup pwm1_pwm_fpe_fpe3 FPE3 Fault Protection Enable for channel 3
@{*/
/**@}*/


#define PWM1_PWM_FPE_FPE2_SHIFT		16
#define PWM1_PWM_FPE_FPE2_MASK		0xff
/** @defgroup pwm1_pwm_fpe_fpe2 FPE2 Fault Protection Enable for channel 2
@{*/
/**@}*/


#define PWM1_PWM_FPE_FPE1_SHIFT		8
#define PWM1_PWM_FPE_FPE1_MASK		0xff
/** @defgroup pwm1_pwm_fpe_fpe1 FPE1 Fault Protection Enable for channel 1
@{*/
/**@}*/


#define PWM1_PWM_FPE_FPE0_SHIFT		0
#define PWM1_PWM_FPE_FPE0_MASK		0xff
/** @defgroup pwm1_pwm_fpe_fpe0 FPE0 Fault Protection Enable for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_elmr[0] PWMELMR[0] PWM Event Line 0 Mode Register 0
@{*/

/** PWM1_PWM_ELMR[0]_CSEL7 Comparison 7 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL7		(1 << 7)
/** PWM1_PWM_ELMR[0]_CSEL6 Comparison 6 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL6		(1 << 6)
/** PWM1_PWM_ELMR[0]_CSEL5 Comparison 5 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL5		(1 << 5)
/** PWM1_PWM_ELMR[0]_CSEL4 Comparison 4 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL4		(1 << 4)
/** PWM1_PWM_ELMR[0]_CSEL3 Comparison 3 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL3		(1 << 3)
/** PWM1_PWM_ELMR[0]_CSEL2 Comparison 2 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL2		(1 << 2)
/** PWM1_PWM_ELMR[0]_CSEL1 Comparison 1 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL1		(1 << 1)
/** PWM1_PWM_ELMR[0]_CSEL0 Comparison 0 Selection **/
#define PWM1_PWM_ELMR[0]_CSEL0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_elmr[1] PWMELMR[1] PWM Event Line 0 Mode Register 0
@{*/

/** PWM1_PWM_ELMR[1]_CSEL7 Comparison 7 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL7		(1 << 7)
/** PWM1_PWM_ELMR[1]_CSEL6 Comparison 6 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL6		(1 << 6)
/** PWM1_PWM_ELMR[1]_CSEL5 Comparison 5 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL5		(1 << 5)
/** PWM1_PWM_ELMR[1]_CSEL4 Comparison 4 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL4		(1 << 4)
/** PWM1_PWM_ELMR[1]_CSEL3 Comparison 3 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL3		(1 << 3)
/** PWM1_PWM_ELMR[1]_CSEL2 Comparison 2 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL2		(1 << 2)
/** PWM1_PWM_ELMR[1]_CSEL1 Comparison 1 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL1		(1 << 1)
/** PWM1_PWM_ELMR[1]_CSEL0 Comparison 0 Selection **/
#define PWM1_PWM_ELMR[1]_CSEL0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_sspr PWMSSPR PWM Spread Spectrum Register
@{*/

/** PWM1_PWM_SSPR_SPRDM Spread Spectrum Counter Mode **/
#define PWM1_PWM_SSPR_SPRDM		(1 << 24)

#define PWM1_PWM_SSPR_SPRD_SHIFT		0
#define PWM1_PWM_SSPR_SPRD_MASK		0xffffff
/** @defgroup pwm1_pwm_sspr_sprd SPRD Spread Spectrum Limit Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_sspup PWMSSPUP PWM Spread Spectrum Update Register
@{*/


#define PWM1_PWM_SSPUP_SPRDUP_SHIFT		0
#define PWM1_PWM_SSPUP_SPRDUP_MASK		0xffffff
/** @defgroup pwm1_pwm_sspup_sprdup SPRDUP Spread Spectrum Limit Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_smmr PWMSMMR PWM Stepper Motor Mode Register
@{*/

/** PWM1_PWM_SMMR_DOWN1 DOWN Count **/
#define PWM1_PWM_SMMR_DOWN1		(1 << 17)
/** PWM1_PWM_SMMR_DOWN0 DOWN Count **/
#define PWM1_PWM_SMMR_DOWN0		(1 << 16)
/** PWM1_PWM_SMMR_GCEN1 Gray Count ENable **/
#define PWM1_PWM_SMMR_GCEN1		(1 << 1)
/** PWM1_PWM_SMMR_GCEN0 Gray Count ENable **/
#define PWM1_PWM_SMMR_GCEN0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_fpv2 PWMFPV2 PWM Fault Protection Value 2 Register
@{*/

/** PWM1_PWM_FPV2_FPZL3 Fault Protection to Hi-Z for PWML output on channel 3 **/
#define PWM1_PWM_FPV2_FPZL3		(1 << 19)
/** PWM1_PWM_FPV2_FPZL2 Fault Protection to Hi-Z for PWML output on channel 2 **/
#define PWM1_PWM_FPV2_FPZL2		(1 << 18)
/** PWM1_PWM_FPV2_FPZL1 Fault Protection to Hi-Z for PWML output on channel 1 **/
#define PWM1_PWM_FPV2_FPZL1		(1 << 17)
/** PWM1_PWM_FPV2_FPZL0 Fault Protection to Hi-Z for PWML output on channel 0 **/
#define PWM1_PWM_FPV2_FPZL0		(1 << 16)
/** PWM1_PWM_FPV2_FPZH3 Fault Protection to Hi-Z for PWMH output on channel 3 **/
#define PWM1_PWM_FPV2_FPZH3		(1 << 3)
/** PWM1_PWM_FPV2_FPZH2 Fault Protection to Hi-Z for PWMH output on channel 2 **/
#define PWM1_PWM_FPV2_FPZH2		(1 << 2)
/** PWM1_PWM_FPV2_FPZH1 Fault Protection to Hi-Z for PWMH output on channel 1 **/
#define PWM1_PWM_FPV2_FPZH1		(1 << 1)
/** PWM1_PWM_FPV2_FPZH0 Fault Protection to Hi-Z for PWMH output on channel 0 **/
#define PWM1_PWM_FPV2_FPZH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_wpcr PWMWPCR PWM Write Protection Control Register
@{*/


#define PWM1_PWM_WPCR_WPKEY_SHIFT		8
#define PWM1_PWM_WPCR_WPKEY_MASK		0xffffff
/** @defgroup pwm1_pwm_wpcr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PWM1_PWM_WPCR_WPRG5 Write Protection Register Group 5 **/
#define PWM1_PWM_WPCR_WPRG5		(1 << 7)
/** PWM1_PWM_WPCR_WPRG4 Write Protection Register Group 4 **/
#define PWM1_PWM_WPCR_WPRG4		(1 << 6)
/** PWM1_PWM_WPCR_WPRG3 Write Protection Register Group 3 **/
#define PWM1_PWM_WPCR_WPRG3		(1 << 5)
/** PWM1_PWM_WPCR_WPRG2 Write Protection Register Group 2 **/
#define PWM1_PWM_WPCR_WPRG2		(1 << 4)
/** PWM1_PWM_WPCR_WPRG1 Write Protection Register Group 1 **/
#define PWM1_PWM_WPCR_WPRG1		(1 << 3)
/** PWM1_PWM_WPCR_WPRG0 Write Protection Register Group 0 **/
#define PWM1_PWM_WPCR_WPRG0		(1 << 2)

#define PWM1_PWM_WPCR_WPCMD_SHIFT		0
#define PWM1_PWM_WPCR_WPCMD_MASK		0x03
/** @defgroup pwm1_pwm_wpcr_wpcmd WPCMD Write Protection Command
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_wpsr PWMWPSR PWM Write Protection Status Register
@{*/


#define PWM1_PWM_WPSR_WPVSRC_SHIFT		16
#define PWM1_PWM_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pwm1_pwm_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PWM1_PWM_WPSR_WPHWS5 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS5		(1 << 13)
/** PWM1_PWM_WPSR_WPHWS4 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS4		(1 << 12)
/** PWM1_PWM_WPSR_WPHWS3 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS3		(1 << 11)
/** PWM1_PWM_WPSR_WPHWS2 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS2		(1 << 10)
/** PWM1_PWM_WPSR_WPHWS1 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS1		(1 << 9)
/** PWM1_PWM_WPSR_WPHWS0 Write Protect HW Status **/
#define PWM1_PWM_WPSR_WPHWS0		(1 << 8)
/** PWM1_PWM_WPSR_WPVS Write Protect Violation Status **/
#define PWM1_PWM_WPSR_WPVS		(1 << 7)
/** PWM1_PWM_WPSR_WPSWS5 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS5		(1 << 5)
/** PWM1_PWM_WPSR_WPSWS4 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS4		(1 << 4)
/** PWM1_PWM_WPSR_WPSWS3 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS3		(1 << 3)
/** PWM1_PWM_WPSR_WPSWS2 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS2		(1 << 2)
/** PWM1_PWM_WPSR_WPSWS1 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS1		(1 << 1)
/** PWM1_PWM_WPSR_WPSWS0 Write Protect SW Status **/
#define PWM1_PWM_WPSR_WPSWS0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_cmupd0 PWMCMUPD0 PWM Channel Mode Update Register (ch_num = 0)
@{*/

/** PWM1_PWM_CMUPD0_CPOLINVUP Channel Polarity Inversion Update **/
#define PWM1_PWM_CMUPD0_CPOLINVUP		(1 << 13)
/** PWM1_PWM_CMUPD0_CPOLUP Channel Polarity Update **/
#define PWM1_PWM_CMUPD0_CPOLUP		(1 << 9)

/**@}*/

/** @defgroup pwm1_pwm_cmupd1 PWMCMUPD1 PWM Channel Mode Update Register (ch_num = 1)
@{*/

